In [1]:
import pandas as pd

In [2]:
# file loading
file_path = './train.csv'
titan_df = pd.read_csv(file_path, engine='python') # DataFrame의 약자 df

In [3]:
# 1. 데이터 이해(-기술통계량, 크기, 데이터 형태...)
# 1.-1) 그래프 -> EDA(Exploratory Data Analysis)
titan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
# 범주형 데이터의 빈도값을 확인 => value_counts()함수
titan_df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [5]:
# 컬럼명 변경해보기
titan_df.rename(columns={'Sex':'Gender'}, inplace=True)

#### DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호변환

In [6]:
import numpy as np
import pandas as pd

#### DataFrame 으로 변환하기

In [7]:
# 3개의 컬럼으로 이름을 짓는다.
col_name1 = ['col1', 'col2', 'col3']

# (2, 3) 형태의 list를 생성 => ndarray로 변형 => DataFrame으로 변환
l2 = [[1, 2, 3],
     [11, 22, 33]]

array2d = np.array(l2)
print('array2d shape:\n', array2d.shape)

l2_df = pd.DataFrame(l2, columns=col_name1)  # 2차원 데이터
print('2차원 리스트로 만든 DataFrame:\n', l2_df)

array2d_df = pd.DataFrame(array2d, columns=col_name1)  # 2차원 데이터
print('2차원 리스트로 만든 DataFrame:\n', array2d_df)

array2d shape:
 (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

In [8]:
# dict => DataFrame 생성
# key 값이 colunm 명이 되고, value 값은 그대로 value 값으로
# list 와 array 는 요소가 row를 채우고, dict 값은 colunm을 채운다는 차이가 있군.
# 그래서 데이터 구조는 dict 로 만드는게 좋은거같다.

dict123 = {'col1': [1, 11],
          'col2': [2, 22],
          'col3': [3, 33]}

dict123_df = pd.DataFrame(dict123)
dict123_df

   col1  col2  col3
0     1     2     3
1    11    22    33

#### DataFrame을 다른 자료로 변환

In [9]:
# .values를 통해 => ndarray로 변환
array_dict = dict123_df.values
print('array_dict.values의 타입: ', type(array_dict), 'array_dict의 shape: ', array_dict.shape)
array_dict

array_dict.values의 타입:  <class 'numpy.ndarray'> array_dict의 shape:  (2, 3)

array([[ 1,  2,  3],
       [11, 22, 33]], dtype=int64)

In [10]:
# adarray => list로 변환
## list() 이거로 변환하면 str 값만 저장됨 그래서 .tolist() 함수를 사용

array_dict.tolist()

[[1, 2, 3], [11, 22, 33]]

In [11]:
# DataFrame 을 dict 로 변환
## dict 는 list와 달리 한번에 변환이 된다.

dict123_df.to_dict()  # 매개변수를 주지 않으면 default 값이 dict로 들어간다.
dict123_df.to_dict('list')  # 매개변수를 list로 줄 수 있다.

{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

#### 새로운 컬럼 추가/삭제

In [12]:
# Colunm 추가시에는
# DataFrame명['Colunm명'] = 오른쪽에는 값 혹은 법칙

titan_df['Age_0'] = 0
titan_df['Age_by_10'] = titan_df.Age * 10
titan_df['Fam_no'] = titan_df.SibSp + titan_df.Parch + 1

In [13]:
titan_df.head(3)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Fam_no
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [14]:
# 추가된 열들 삭제 (열은 axis=1)
# titan_df1 = titan_df.drop(columns=['Age_0', 'Age_by_10', 'Fam_no']) # 아래와 같음
# titan_df1 = titan_df.drop(['Age_0', 'Age_by_10', 'Fam_no'], axis=1)  # return 값으로 반환하나보네
titan_df.drop(['Age_0', 'Age_by_10', 'Fam_no'], axis=1, inplace=True)  # inplace를 주면 return은 없고 내부적으로 실행됨. 오류가 필요할때 사용

In [15]:
# 기존의 행들을 삭제한다. (행은 axis=0)
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('### before axis 0 drop ###')
print(titan_df.head(3))


titan_df1 = titan_df.drop([1,3], axis=0)
# titan_df.drop([1,3], axis=0, inplace=True)

print('### after axis 0 drop ###')
print(titan_df1.head(3))

### before axis 0 drop ###
   PassengerId  Survived  Pclass            Name  Gender   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
### after axis 0 drop ###
   PassengerId  Survived  Pclass            Name  Gender   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S